# Создать 3 переменные с одинаковыми данными и с одинаковыми идентификаторами

num1 = 1
num2 = 1
num3 = 1
print(id(num1))
print(id(num2))
print(id(num3))