# Пусть у нас есть массив слов food = ['котлета', 'пюрешка', 'драники', 'пицца', 'мороженное'].
# Вывести на консоль два блюда, которые больше всего нравятся, в формате:
# 'Из предложенного я больше люблю <блюдо1> и <блюдо2>'

food = ['котлета', 'пюрешка', 'драники', 'пицца', 'мороженное']
print(f"Из предложенного я больше люблю {food[3]} и {food[4]}")
