# Создать 2 переменные с одинаковыми данными и с разными идентификаторами

arr1 = [0, 1, 2]
arr2 = [0, 1, 2]
print(id(arr1))
print(id(arr2))
